app/controllers/events_controller.rb

SELECT "sub_events".* FROM "sub_events"  WHERE "sub_events"."event_id" = $1  [["event_id", 5]]
---
  def show
    @event = Event.find(params[:id])