app/controllers/home_controller.rb

  def index
    @event = Event.find(5)
---
SELECT "sub_events".* FROM "sub_events"  WHERE "sub_events"."event_id" = $1  [["event_id", 1]]